HELLO_MESSAGE = 'Привет, страж! Меня зовут VEGA, я - фрейм Xbox-клана Guardian.FM и моей задачей является ' \
                'автоматизация рутинных действий внутри клана. Вот что ты можешь сделать: '

TAG_ERROR_MESSAGE = '❌❌❌ Ой-ей, похоже, у тебя не установлен телеграм-тэг. ' \
                    'В таком случае, администрация клана не сможет тебя найти и пригласить в наш телеграм-чат.' \
                    ' Что же делать делать? Ты можешь установить тэг, ' \
                    '<a href="https://telegramzy.ru/nik-v-telegramm/"> ' \
                    'как это сделать - описано в этой инструкции</a>. ' \
                    'После этого ты сможешь заполнить анкету соискателя, написав /register.'

CLAN_CHARTER_MESSAGE = 'Перед подачей заявки, пожалуйста, ознакомься с уставом клана. Он находится ' \
                       '<a href="https://docs.google.com/document/d/1phtUEpk8as8rn3pLCT5eelAdsCH1QB8d5vT7E4YDS4w">тут</a>. ' \
                       '<b>⚠️⚠️⚠️ Обрати внимание - дальнейшее продолжение диалога со' \
                       ' мной подтверждает то, что ты ознакомился ' \
                       'и согласен с уставом! ⚠️⚠️⚠️</b>.'

TELL_ABOUT_MESSAGE = 'Отлично! Последний штрих - расскажи немного о себе. Да, это не обязательно, но заявки от ' \
                     'участников, которые не поленились и потратили 5 минут на "интро" рассматриваются ' \
                     'администраторами быстрее. Хоть я и бездушная машина, я понимаю, что писать о себе всегда ' \
                     'сложно, поэтому вот список вопросов, на которые ты можешь ответить в своем интро: как давно ты ' \
                     'играешь в Destiny? Где живешь? Чем увлекаешься IRL? Ходил ли ты в рейды, и если да - то какой ' \
                     'из них - твой любимый?'

APPROVE_TO_USER_MESSAGE = 'Администрация клана рассмотрела вашу заявку. Добро пожаловать! Для координации и общения ' \
                          'у нас есть <a href="https://t.me/joinchat/T-VtrgW1KbFcWfoo">чат</a>.'

ADMIN_APPROVE_MESSAGE = '\n<b>Пользователь принят в клан, не забудьте одобрить заявку в ' \
                           '<a href="https://www.bungie.net/ru/ClanV2?groupid=2135560">Bungie.net</a>!</b>'

DECLINE_TO_USER_MESSAGE = 'Администрация клана рассмотрела вашу заявку. ' \
                          'К сожалению, на данный момент мы не готовы вас принять.'

ADMIN_DECLINE_MESSAGE = '\nБыло принято решение отказать соискателю.'

BUNGIE_NET_MESSAGE = 'Если же все ок - нет причин волноваться, твоя заявка была передана на рассмотрение ' \
                     'администрации. А пока можешь отправить заявку на вступление в ' \
                     '<a href="https://www.bungie.net/ru/ClanV2?groupid=2135560">наш клан в Bungie.net</a> ' \
                     '(если ты этого все еще не сделал).'

RESET_MESSAGE = 'Если ты где-то что-то заполнил неправильно - не переживай. ' \
                'Ты можешь просто нажать на кнопку ниже и заполнить анкету заново. Главное - без фанатизма.'

ERROR_MESSAGE = '///ОШИБКА \n>>УД4Л3ННЫЙ У33Л: НЕТ 0Т83ТА \n//П3РЕЗ4ПУСК'


HELP_MESSAGE = 'Здесь должно быть сообщение о помощи, но мне лень, так что помогите себе сами'
